app/views/comments/destroy.js.erb

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 14]]
---
<% if @comment.destroyed? %>