app/views/tasks/destroy.js.erb

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 10]]
---
<% if @task.destroyed? %>