app/views/tasks/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."task_id" = $1  [["task_id", 7]]
---
  <div class='comments_list'>
    <% @task.comments.each do |comment| %>