app/views/projects/destroy.js.erb

<% if @project.destroyed? %>
---
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 13]]