app/controllers/comments_controller.rb

INSERT INTO "comments" ("task_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["task_id", 8], ["description", "comment11"], ["created_at", "2018-05-14 09:48:40.746298"], ["updated_at", "2018-05-14 09:48:40.746298"]]
---
  def create
    @comment = @task.comments.new(comment_params)
    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."task_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["task_id", 8], ["id", 25], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 25]]
---
  def destroy
    @comment = @task.comments.find(params[:id])
    if @comment.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def find_task
    @task = Task.find(params[:task_id])