app/controllers/projects_controller.rb

INSERT INTO "projects" ("user_id", "name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["name", "Test1"], ["description", "testing"], ["created_at", "2018-05-11 11:38:59.704042"], ["updated_at", "2018-05-11 11:38:59.704042"]]
---
  def create
    @project = current_user.projects.new(project_params)
    if @project.save(params[:project])

UPDATE "projects" SET "description" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["description", "task listing appp"], ["updated_at", "2018-05-11 11:40:18.089528"], ["id", 16]]
---
  def update
    if @project.update(project_params)

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 19]]
---
  def destroy
    if @project.destroy

SELECT  "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 16], ["LIMIT", 1]]
---
  def find_project
    @project = current_user.projects.find(params[:id])