app/controllers/tasks_controller.rb

  def create
    @task = @project.tasks.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("project_id", "name", "description", "priority", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["project_id", 16], ["name", "Test"], ["description", "Task testing"], ["priority", 1], ["created_at", "2018-05-14 04:38:53.306660"], ["updated_at", "2018-05-14 04:38:53.306660"]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "priority" = $1, "deadline" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["priority", 0], ["deadline", "2018-05-29 00:00:00"], ["updated_at", "2018-05-14 05:51:08.887881"], ["id", 5]]

  def destroy
    if @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 6]]

  def find_project
    @project = current_user.projects.find(params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 16], ["LIMIT", 1]]

  def find_task
    @task = @project.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["project_id", 16], ["id", 4], ["LIMIT", 1]]